app/controllers/analytics_controller.rb

    def ping
        uuid = request.remote_ip
        version = params[:version]

        @ping = Ping.find_by_uuid(uuid) || Ping.create(uuid: uuid)
        @ping.update(version: version)
---
INSERT INTO "pings" ("uuid", "created_at", "updated_at") VALUES (?, ?, ?)  [["uuid", "aaa"], ["created_at", "2015-11-18 22:57:42.529694"], ["updated_at", "2015-11-18 22:57:42.529694"]]
SELECT  "pings".* FROM "pings" WHERE "pings"."uuid" = ? LIMIT 1  [["uuid", "aaa"]]
UPDATE "pings" SET "version" = ?, "updated_at" = ? WHERE "pings"."id" = ?  [["version", "0.9"], ["updated_at", "2015-11-18 23:25:40.317643"], ["id", 1]]